FC_Department_sand_2022/FC_Department_Baseline_Tests.yml
execution:
#- executor: jmeter
- concurrency: 250
  ramp-up: 250s
  hold-for: 55m
  scenario: Department_Sand_Service

scenarios:
  Department_Sand_Service:
    script: Department_Sand_Service.jmx
    
modules:
  console:
    disable: true # disable runtime console reporter

reporting:
#- module: console
- module: passfail
  criteria:
  - avg-rt>10s for 30s, stop as failed
  - fail>50% for 20s, stop as failed